tap "argon/mas"                 # Mac App Store
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "neovim/neovim"
cask "java"
cask "xquartz"
brew "autoconf"                 # ビルドツールらしい
brew "autojump"                 # よく使うj command
brew "automake"                 # ビルドツールらしい
brew "gettext"                  # 多言語対応で使うらしい
brew "curl"                     # curl
brew "ffmpeg"                   # ffmpeg
brew "gcc"
brew "git"
brew "goenv"
brew "heroku"
brew "imagemagick"
brew "jq"
brew "lame"
brew "mysql"
brew "neovim"
brew "nkf"
brew "peco"                     # 補完で使ってる
brew "pipenv"
brew "rbenv"
brew "redis"
brew "ruby-build"
brew "squid"                    # squid proxy server
brew "terminal-notifier"        # 通知送れる
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "zsh", args: ["without-etcdir"]
brew "argon/mas/mas"

cask "evernote"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "macvim"
cask "skype"
cask "slack"
cask "steam"
cask "sublime-text"
cask "vagrant"
#cask "virtualbox"		# なんかエラー出る事があるからコメントアウト
cask "vlc"
cask "authy"
cask "sublime-text"
cask "visual-studio-code"
mas "1Password", id: 443987910
mas "iMovie", id: 408981434
mas "IP Scanner", id: 404167149
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "LINE", id: 539883307
mas "Pages", id: 409201541
mas "Reeder", id: 880001334
mas "SiteSucker", id: 442168834
mas "Telegram", id: 747648890
mas "WeChat", id: 836500024
